app/controllers/modulo_remitentes_controller.rb

SELECT "modulo_remitentes".* FROM "modulo_remitentes"
---
  def index
    @modulo_remitentes = ModuloRemitente.all

INSERT INTO "modulo_remitentes" ("cargo", "ciudad", "created_at", "departamento", "direccion", "email", "fecha_solicitud", "nombre", "nombre_entidad", "telefono", "tipo_entidad", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @modulo_remitente = ModuloRemitente.new(modulo_remitente_params)
    @modulo_remitente.save

UPDATE "modulo_remitentes" SET "paciente_id" = ?, "updated_at" = ? WHERE "modulo_remitentes"."id" = 1  [["paciente_id", 1], ["updated_at", "2014-11-22 13:44:58.180083"]]
---
  def update
    @modulo_remitente.update(modulo_remitente_params)

SELECT  "modulo_remitentes".* FROM "modulo_remitentes"  WHERE "modulo_remitentes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_modulo_remitente
      @modulo_remitente = ModuloRemitente.find(params[:id])