app/controllers/modulo_receptoras_controller.rb

  def index
    @modulo_receptoras = ModuloReceptora.all
---
SELECT "modulo_receptoras".* FROM "modulo_receptoras"

  def create
    @modulo_receptora = ModuloReceptora.new(modulo_receptora_params)
    @modulo_receptora.save
---
INSERT INTO "modulo_receptoras" ("cargo", "ciudad", "created_at", "departamento", "direccion", "email", "fecha_elaboracion", "fecha_notificacion", "fecha_recepcion", "fecha_valoracion", "nombre_entidad", "nombre_receptor", "numero_dictamen", "paciente_id", "telefono", "tipo_entidad", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_modulo_receptora
      @modulo_receptora = ModuloReceptora.find(params[:id])
---
SELECT  "modulo_receptoras".* FROM "modulo_receptoras"  WHERE "modulo_receptoras"."id" = ? LIMIT 1  [["id", 1]]