app/controllers/modulo_calificadas_controller.rb

SELECT "modulo_calificadas".* FROM "modulo_calificadas"
---
  def index
    @modulo_calificadas = ModuloCalificada.all