app/controllers/pacientes_controller.rb

  def index
    @pacientes = Paciente.all
---
SELECT "pacientes".* FROM "pacientes"

  def create
    @paciente = Paciente.new(paciente_params)
    @paciente.save
---
INSERT INTO "pacientes" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2014-11-22 13:23:30.899873"], ["updated_at", "2014-11-22 13:23:30.899873"], ["user_id", 1]]

    def set_paciente
      @paciente = Paciente.find(params[:id])
---
SELECT  "pacientes".* FROM "pacientes"  WHERE "pacientes"."id" = ? LIMIT 1  [["id", 1]]