app/controllers/rols_controller.rb

SELECT "rols".* FROM "rols"
---
  def index
    @rols = Rol.all

INSERT INTO "rols" ("created_at", "nombre", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-22 13:33:07.346085"], ["nombre", "Medico"], ["updated_at", "2014-11-22 13:33:07.346085"], ["user_id", 1]]
---
  def create
    @rol = Rol.new(rol_params)
    @rol.save

SELECT  "rols".* FROM "rols"  WHERE "rols"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_rol
      @rol = Rol.find(params[:id])